[
  {"id":"alvinaExpressiveKeyboardsEnriching2016","abstract":"Gesture-typing is an efficient, easy-to-learn, and errortolerant technique for entering text on software keyboards. Our goal is to \"recycle\" users' otherwise-unused gesture variation to create rich output under the users' control, without sacrificing accuracy. Experiment 1 reveals a high level of existing gesture variation, even for accurate text, and shows that users can consciously vary their gestures under different conditions. We designed an Expressive Keyboard for a smart phone which maps input gesture features identified in Experiment 1 to a continuous output parameter space, i.e. RGB color. Experiment 2 shows that users can consciously modify their gestures, while retaining accuracy, to generate specific colors as they gesture-type. Users are more successful when they focus on output characteristics (such as red) rather than input characteristics (such as curviness). We designed an app with a dynamic font engine that continuously interpolates between several typefaces, as well as controlling weight and random variation. Experiment 3 shows that, in the context of a more ecologically-valid conversation task, users enjoy generating multiple forms of rich output. We conclude with suggestions for how the Expressive Keyboard approach can enhance a wide variety of gesture recognition applications.","author":[{"family":"Alvina","given":"Jessalyn"},{"family":"Malloch","given":"Joseph W."},{"family":"Mackay","given":"W."}],"container-title":"UIST","DOI":"10/gjh43b","issued":{"date-parts":[[2016]]},"source":"Semantic Scholar","title":"Expressive Keyboards: Enriching Gesture-Typing on Mobile Devices","title-short":"Expressive Keyboards","type":"article-journal"},
  {"id":"ankuCirclesTimeTheory2000","accessed":{"date-parts":[[2021,1,8]]},"author":[{"family":"Anku","given":"Willie"}],"container-title":"Music Theory Online","issue":"1","issued":{"date-parts":[[2000,1,1]]},"language":"en","source":"www.mtosmt.org","title":"Circles and Time: A Theory of Structural Organization of Rhythm in African Music","title-short":"Circles and Time","type":"article-journal","URL":"https://www.mtosmt.org/issues/mto.00.6.1/mto.00.6.1.anku.html","volume":"6"},
  {"id":"babbittAdinkraMathematicsStudy2015","abstract":"This paper details the development and evaluation of software that allows middle school students to explore the mathematical aspects of Ghanaian Adinkra symbols. We tested the effectiveness of this simulation in a Ghanaian junior high school by conducting a randomized quasi-experiment. We begin this paper by framing culturally responsive math education within the interventionist tradition of ethnomathematics. We draw this tradition together with an empirical exploration of the mathematics embedded in Adinkra symbols. We follow this with a methodological explanation for how we translated the mathematical significance of $GLQNUD LQWR WKH GHVLJQ RI RXU VRIWZDUH  ³&XOWXUDOO\\ 6LWXDWHG 'HVLJQ 7RROV ´ )LQDOO\\   we describe the quasi-experimental evaluation of the software using a randomized assignment of students in control and intervention groups in Ghana. We found statistically significant improvement for students using the culture-based software in comparison to similar software with no cultural content.","accessed":{"date-parts":[[2021,1,5]]},"author":[{"family":"Babbitt","given":"William"},{"family":"Lachney","given":"Michael"},{"family":"Bulley","given":"Enoch"},{"family":"Eglash","given":"Ron"}],"container-title":"Multidisciplinary Journal of Educational Research","container-title-short":"REMIE","DOI":"10.17583/remie.2015.1399","ISSN":"2014-2862","issue":"2","issued":{"date-parts":[[2015,6,15]]},"language":"en","page":"110","source":"DOI.org (Crossref)","title":"Adinkra Mathematics: A study of Ethnocomputing in Ghana","title-short":"Adinkra Mathematics","type":"article-journal","URL":"http://hipatiapress.com/hpjournals/index.php/remie/article/view/1399","volume":"5"},
  {"id":"babbittEthnomathematicsEthnocomputing2012","abstract":"Ethnomathematics faces two challenges: first, it must investigate the mathematical ideas in cultural practices that are often assumed to be unrelated to mathematics. Second, even if we are successful in finding this previously unrecognized mathematics, applying this to children’s education may be difficult. In this essay, we will describe the use of computational media to help address both of these challenges.","author":[{"family":"Babbitt","given":"Bill"},{"family":"Lyles","given":"Dan"},{"family":"Eglash","given":"Ron"}],"DOI":"10.1007/978-94-6091-921-3_10","ISBN":"978-94-6091-921-3","issued":{"date-parts":[[2012,1,1]]},"page":"205-219","source":"ResearchGate","title":"From Ethnomathematics to Ethnocomputing","type":"chapter"},
  {"id":"babbittEthnomathematicsEthnocomputingIndigenous2012","accessed":{"date-parts":[[2021,1,5]]},"author":[{"family":"Babbitt","given":"Bill"},{"family":"Lyles","given":"Dan"},{"family":"Eglash","given":"Ron"}],"container-title":"Alternative Forms of Knowing (in) Mathematics","DOI":"10.1007/978-94-6091-921-3_10","editor":[{"family":"Mukhopadhyay","given":"Swapna"},{"family":"Roth","given":"Wolff-Michael"}],"event-place":"Rotterdam","ISBN":"978-94-6091-921-3","issued":{"date-parts":[[2012]]},"language":"en","page":"205-219","publisher":"SensePublishers","publisher-place":"Rotterdam","source":"DOI.org (Crossref)","title":"From Ethnomathematics to Ethnocomputing: Indigenous Algorithms in Traditional Context & Contemporary Simulation","title-short":"From Ethnomathematics to Ethnocomputing","type":"chapter","URL":"http://link.springer.com/10.1007/978-94-6091-921-3_10"},
  {"id":"ballSelfMadeTapestryPattern2001","abstract":"For centuries, scientists have struggled to understand the origins of the patterns and forms found in nature. Now, in this lucid and accessibly written book, Philip Ball applies state-of-the-art scientific understanding from the fields of biology, chemistry, geology, physics, and mathematics to these ancient mysteries, revealing how nature's seemingly complex patterns originate in simple physical laws. Tracing the history of scientific thought about natural patterns, Ball shows how common presumptions--for example, that complex form must be guided by some intelligence or that form always follows function--are erroneous and continue to mislead scientists today. He investigates specific patterns in depth, revealing that these designs are self-organized and that simple, local interactions between component parts produce motifs like spots, stripes, branches, and honeycombs. In the process, he examines the mysterious phenomenon of symmetry and why it appears--and breaks--in similar ways in different systems. Finally, he attempts to answer this profound question: why are some patterns universal? Illustrations throughout the text, many in full color, beautifully illuminate Ball's ideas.","author":[{"family":"Ball","given":"Philip"}],"event-place":"Oxford, New York","ISBN":"978-0-19-850243-2","issued":{"date-parts":[[2001,10,18]]},"number-of-pages":"312","publisher":"Oxford University Press","publisher-place":"Oxford, New York","source":"Oxford University Press","title":"The Self-Made Tapestry: Pattern Formation in Nature","title-short":"The Self-Made Tapestry","type":"book"},
  {"id":"bartonMakingSenseEthnomathematics1996","abstract":"There are unacknowledged difficulties within the literature of culture and mathematics, specifically in the use of the term ethnomathematics. As a step towards a more coherent approach, a framework to review the literature is proposed, and three authors examined. From this analysis, a definition of ethnomathematics is derived and elaborated. Two examples are reviewed as a test of the power of the definition and the resultant description of ethnomathematics.","accessed":{"date-parts":[[2021,1,5]]},"author":[{"family":"Barton","given":"Bill"}],"container-title":"Educational Studies in Mathematics","ISSN":"0013-1954","issue":"1/2","issued":{"date-parts":[[1996]]},"page":"201-233","publisher":"Springer","source":"JSTOR","title":"Making Sense of Ethnomathematics: Ethnomathematics Is Making Sense","title-short":"Making Sense of Ethnomathematics","type":"article-journal","URL":"https://www.jstor.org/stable/3482940","volume":"31"},
  {"id":"ChristopherAlexanderPatterns","accessed":{"date-parts":[[2021,1,5]]},"title":"Christopher Alexander - Patterns in Architecture (transcription)","type":"webpage","URL":"http://www.patternlanguage.com/archive/ieee.html"},
  {"id":"eglashAfricanFractalsModern1999","abstract":"Fractals are characterized by the repetition of similar patterns at ever-diminishing scales. Fractal geometry has emerged as one of the most exciting frontiers on the border between mathematics and information technology and can be seen in many of the swirling patterns produced by computer graphics. It has become a new tool for modeling in biology, geology, and other natural sciences. Anthropologists have observed that the patterns produced in different cultures can be characterized by specific design themes. In Europe and America, we often see cities laid out in a grid pattern of straight streets and right-angle corners. In contrast, traditional African settlements tend to use fractal structures-circles of circles of circular dwellings, rectangular walls enclosing ever-smaller rectangles, and streets in which broad avenues branch down to tiny footpaths with striking geometric repetition. These indigenous fractals are not limited to architecture; their recursive patterns echo throughout many disparate African designs and knowledge systems. Drawing on interviews with African designers, artists, and scientists, Ron Eglash investigates fractals in African architecture, traditional hairstyling, textiles, sculpture, painting, carving, metalwork, religion, games, practical craft, quantitative techniques, and symbolic systems. He also examines the political and social implications of the existence of African fractal geometry. His book makes a unique contribution to the study of mathematics, African culture, anthropology, and computer simulations.","author":[{"family":"Eglash","given":"Ron"}],"edition":"Illustrated edition","event-place":"New Brunswick, N.J","ISBN":"978-0-8135-2614-0","issued":{"date-parts":[[1999,6,30]]},"language":"English","number-of-pages":"272","publisher":"Rutgers University Press","publisher-place":"New Brunswick, N.J","source":"Amazon","title":"African Fractals: Modern Computing and Indigenous Design","title-short":"African Fractals","type":"book"},
  {"id":"EthnomathematicsWikipedia2020","abstract":"In mathematics education, ethnomathematics is the study of the relationship between mathematics and culture. Often associated with \"cultures without written expression\", it may also be defined as \"the mathematics which is practised among identifiable cultural groups\". It refers to a broad cluster of ideas ranging from distinct numerical and mathematical systems to multicultural mathematics education. The goal of ethnomathematics is to contribute both to the understanding of culture and the understanding of mathematics, and mainly to lead to an appreciation of the connections between the two.","accessed":{"date-parts":[[2021,1,5]]},"container-title":"Wikipedia","issued":{"date-parts":[[2020,10,27]]},"language":"en","note":"Page Version ID: 985729066","source":"Wikipedia","title":"Ethnomathematics (wikipedia)","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Ethnomathematics&oldid=985729066"},
  {"id":"franklinRealWorldTechnology1999","abstract":"In this expanded edition of her bestselling 1989 CBC Massey Lectures, renowned scientist and humanitarian Ursula M. Franklin examines the impact of technology upon our lives and addresses the extraordinary changes since The Real World of Technology was first published.  In four new chapters, Franklin tackles contentious issues, such as the dilution of privacy and intellectual property rights, the impact of the current technology on government and governance, the shift from consumer capitalism to investment capitalism, and the influence of the Internet upon the craft of writing.","author":[{"family":"Franklin","given":"Ursula"}],"edition":"2nd edition","issued":{"date-parts":[[1999,6,1]]},"language":"English","number-of-pages":"224","publisher":"House of Anansi Press","source":"Amazon","title":"The Real World of Technology","type":"book"},
  {"id":"grunbaumInterlacePatternsIslamic1992","accessed":{"date-parts":[[2021,1,5]]},"author":[{"family":"Grünbaum","given":"Branko"},{"family":"Shephard","given":"G. C."},{"family":"Grunbaum","given":"Branko"}],"container-title":"Leonardo","container-title-short":"Leonardo","DOI":"10.2307/1575859","ISSN":"0024094X","issue":"3/4","issued":{"date-parts":[[1992]]},"page":"331","source":"DOI.org (Crossref)","title":"Interlace Patterns in Islamic and Moorish Art","type":"article-journal","URL":"https://www.jstor.org/stable/1575859?origin=crossref","volume":"25"},
  {"id":"grunbaumTilingsPatterns2016","abstract":"The definitive book on tiling and geometric patterns, this magnificently illustrated volume features 520 figures and more than 100 tables. Accessible to anyone with a grasp of geometry, it offers numerous graphic examples of two-dimensional spaces covered with interlocking figures, in addition to related problems and references. Suitable for geometry courses as well as independent study, this inspiring book is geared toward students, professional mathematicians, and readers interested in patterns and shapes artists, architects, and crystallographers, among others. Along with helpful examples from mathematics and geometry, it draws upon models from fields as diverse as crystallography, virology, art, philosophy, and quilting. The self-contained chapters need not be read in sequence, and each concludes with an excellent selection of notes and references. The first seven chapters can be used as a classroom text, and the final four contain fascinating browsing material, including detailed surveys of color patterns, groups of color symmetry, and tilings by polygons.","author":[{"family":"Grunbaum","given":"Branko"},{"family":"Shephard","given":"G. C."}],"edition":"2 edition","event-place":"Mineola, New York","ISBN":"978-0-486-46981-2","issued":{"date-parts":[[2016,7,29]]},"language":"English","number-of-pages":"720","publisher":"Dover Publications Inc.","publisher-place":"Mineola, New York","source":"Amazon","title":"Tilings and Patterns","type":"book"},
  {"id":"grunbaumWhatSymmetryGroups2006","author":[{"family":"Grünbaum","given":"Branko"}],"issue":"6","issued":{"date-parts":[[2006]]},"language":"en","page":"4","source":"Zotero","title":"What Symmetry Groups Are Present in the Alhambra?","type":"article-journal","volume":"53"},
  {"id":"huntingMathematicsAustralianAboriginal1987","accessed":{"date-parts":[[2021,1,5]]},"author":[{"family":"Hunting","given":"Robert P."}],"container-title":"For the Learning of Mathematics","ISSN":"0228-0671","issue":"2","issued":{"date-parts":[[1987]]},"page":"5-10","publisher":"FLM Publishing Association","source":"JSTOR","title":"Mathematics and Australian Aboriginal Culture","type":"article-journal","URL":"https://www.jstor.org/stable/40247889","volume":"7"},
  {"id":"josephPoliticsAntiRacistMathematics1994","accessed":{"date-parts":[[2021,1,5]]},"author":[{"family":"Joseph","given":"George Gheverghese"}],"container-title":"European Education","container-title-short":"European Education","DOI":"10.2753/EUE1056-4934260167","ISSN":"1056-4934, 1944-7086","issue":"1","issued":{"date-parts":[[1994,4]]},"language":"en","page":"67-74","source":"DOI.org (Crossref)","title":"The Politics of Anti-Racist Mathematics","type":"article-journal","URL":"https://www.tandfonline.com/doi/full/10.2753/EUE1056-4934260167","volume":"26"},
  {"id":"kharazmiStudyPracticalGeometry2012","abstract":"This paper attempts to survey the use of practical geometry in Sassanid stucco ornament in Ancient Persia to understand the construction of geometrical structures and the progressive process of practical geometry. By use of geometrical analysis, we trace changes of ornament and extract the underlying geometrical structure; we also use symmetry groups, the seven frieze groups and the seventeen wallpaper groups, in order to arrive at a deeper understanding of practical geometry in Sassanid stucco ornament. These analyses will evince features of Sassanid stucco ornament such as: motifs as part of the whole; rotational symmetry and repetition of motifs in linear networks; application of complicated geometrical structures with rotational or reflection symmetry; the planning of whole decorative panels. Also, analyzing the Sassanid stucco panels allows us to discover their repetitive units, which are then classified according to frieze and wallpaper groups.","accessed":{"date-parts":[[2020,10,1]]},"author":[{"family":"Kharazmi","given":"Mahsa"},{"family":"Afhami","given":"Reza"},{"family":"Tavoosi","given":"Mahmood"}],"container-title":"Nexus Network Journal","container-title-short":"Nexus Netw J","DOI":"10.1007/s00004-012-0106-8","ISSN":"1522-4600","issue":"2","issued":{"date-parts":[[2012,8,1]]},"language":"en","page":"227-250","source":"Springer Link","title":"A Study of Practical Geometry in Sassanid Stucco Ornament in Ancient Persia","type":"article-journal","URL":"https://doi.org/10.1007/s00004-012-0106-8","volume":"14"},
  {"id":"lachneyMODELINGETHNOCOMPUTINGREPLACING2016","abstract":"Ethnocomputing is the study of the intersections between culture and computing. In addition to cultural analysis of computing, it also utilizes computing to model artifacts or practices from a given culture. In this essay, we consider three modes of modeling. In the first mode, the knowledge flow is unidirectional: the researcher analyzes indigenous designs and provides a computing model. In the second mode, the knowledge flow is bidirectional with researchers bringing a technical etic (outsider) perspective and informants bringing a cultural emic (insider) perspective. In the third mode, knowledge flow is recursive; there are bidirectional flows nested within other bidirectional flows. Our case study begins with computer simulations of log curves in Adinkra symbols in Ghana. Thus, we show that there are nested flows between nature and the indigenous artisans who model nature’s growth patterns; between our own ethnocomputing simulations and the students and teachers in Ghanaian classrooms; and finally between the history of computing in the West and the implementation of educational technology. Our data indicates that a recursive model that can account for these nested flows better enables researchers to integrate social justice and sustainability with education and research in both social and technical domains.\nKeywords: Agency; Ethnocomputing; Indigenous Design; Modeling; Translation.","author":[{"family":"Lachney","given":"Michael"},{"family":"Bennett","given":"Audrey"},{"family":"Appiah","given":"George"},{"family":"Eglash","given":"Ron"}],"container-title":"International Journal for Research in Mathematics Education","container-title-short":"International Journal for Research in Mathematics Education","issued":{"date-parts":[[2016,5,1]]},"page":"219-243","source":"ResearchGate","title":"MODELING IN ETHNOCOMPUTING: REPLACING BI-DIRECTIONAL FLOWS WITH RECURSIVE EMERGENCE","title-short":"MODELING IN ETHNOCOMPUTING","type":"article-journal","volume":"6"},
  {"id":"lihuiziArtAnthropologyEmergence","accessed":{"date-parts":[[2021,4,29]]},"author":[{"family":"理恵子","given":"田中"}],"source":"core.ac.uk","title":"Between Art and Anthropology: The Emergence of ‘Border’in the Musical Communication","title-short":"Between Art and Anthropology","type":"article-journal","URL":"https://core.ac.uk/reader/230766940"},
  {"id":"mukhopadhyayAlternativeFormsKnowing2012","accessed":{"date-parts":[[2021,1,5]]},"DOI":"10.1007/978-94-6091-921-3","editor":[{"family":"Mukhopadhyay","given":"Swapna"},{"family":"Roth","given":"Wolff-Michael"}],"event-place":"Rotterdam","ISBN":"978-94-6091-921-3","issued":{"date-parts":[[2012]]},"language":"en","publisher":"SensePublishers","publisher-place":"Rotterdam","source":"DOI.org (Crossref)","title":"Alternative Forms of Knowing (in) Mathematics: Celebrations of Diversity of Mathematical Practices","title-short":"Alternative Forms of Knowing (in) Mathematics","type":"book","URL":"http://link.springer.com/10.1007/978-94-6091-921-3"},
  {"id":"mukhopadhyayDecorativeImpulseEthnomathematics2009","accessed":{"date-parts":[[2021,1,5]]},"author":[{"family":"Mukhopadhyay","given":"Swapna"}],"container-title":"ZDM","container-title-short":"ZDM Mathematics Education","DOI":"10.1007/s11858-008-0151-7","ISSN":"1863-9690, 1863-9704","issue":"1-2","issued":{"date-parts":[[2009,1]]},"language":"en","page":"117-130","source":"DOI.org (Crossref)","title":"The decorative impulse: ethnomathematics and Tlingit basketry","title-short":"The decorative impulse","type":"article-journal","URL":"http://link.springer.com/10.1007/s11858-008-0151-7","volume":"41"},
  {"id":"osamusatoArtComputerDesigning1993","abstract":"Official Description: The computer is a magic box. Many graphic images are hidden inside it. This book is a beginner's introduction to calling forth these...","accessed":{"date-parts":[[2020,10,1]]},"author":[{"literal":"Osamu Sato"}],"issued":{"date-parts":[[1993]]},"language":"en","title":"The Art Of Computer Designing: A Black and White Approach : Osamu Sato : Free Download, Borrow, and Streaming","title-short":"The Art Of Computer Designing","type":"book","URL":"https://archive.org/details/satoArtOfComputerDesigning"},
  {"id":"peterpetrashChristopherAlexanderPatterns2013","abstract":"This presentation was recorded live in San Jose, California, October of 1996, at The 1996 ACM Conference on Object-Oriented Programs, Systems, Languages and Applications (OOPSLA).\n\nA full transcript of this talk is available here: http://www.patternlanguage.com/archiv...\n\nVideo transcoded from VHS and provided by The Understanding Group (TUG): http://understandinggroup.com/2011/11...","accessed":{"date-parts":[[2021,1,5]]},"dimensions":"1:03:35","director":[{"literal":"Peter Petrash"}],"issued":{"date-parts":[[2013,9,8]]},"source":"YouTube","title":"Christopher Alexander - Patterns in Architecture (youtube)","type":"motion_picture","URL":"https://www.youtube.com/watch?v=98LdFA-_zfA"},
  {"id":"russellRepeatlessTransformingSurface2014","abstract":"Much of the initial use of digital technology within the printed textile industry has focused on the particular advantages that it has over previous fabric printing methods. Examples include simplifying workflow, producing relatively cheap short runs, or allowing designers to work with photographic imagery and unlimited colour palettes. This paper firstly identifies that digital fabric printing has a fundamentally different possibility in relation to its forerunners. Formerly, printing was essentially the ability to reproduce the same image (or text) over and over again. Digital printing, however, does not have to work from static information; it can print a design that changes as it is being printed.","author":[{"family":"Russell","given":"Alex"}],"issued":{"date-parts":[[2014]]},"language":"en","page":"17","source":"Zotero","title":"Repeatless: transforming surface pattern with generative design","type":"article-journal"},
  {"id":"salingarosArchitecturePatternsMathematics1999","abstract":"Nikos Salingaros posits the importance of architectural pattern in man’s intellectual development, examining how twentieth century architectural attitudes towards decoration and pattern have impoverished man’s experience of both mathematics and the built environment.","accessed":{"date-parts":[[2021,1,5]]},"author":[{"family":"Salingaros","given":"Nikos A."}],"container-title":"Nexus Network Journal","container-title-short":"Nexus Netw J","DOI":"10.1007/s00004-998-0006-0","ISSN":"1522-4600","issue":"1","issued":{"date-parts":[[1999,6,1]]},"language":"en","page":"75-86","source":"Springer Link","title":"Architecture, Patterns, and Mathematics","type":"article-journal","URL":"https://doi.org/10.1007/s00004-998-0006-0","volume":"1"},
  {"id":"seoHanyangKutKorean2019","abstract":"This volume, first published in 2002, presents a sophisticated analysis of the musical instruments, repertoires, musicians and ensembles, and symbolism of the ritual music of Shamans of Seoul, Korea. Placed firmly in a social and historical context, it shows that Shamanism, considered superstition by many today, is alive and well in Seoul in a rich tradition reaching back to the Chosôn Dynasty (1392-1910), the capital of which was Hanyang (now Seoul). The instruments, dress and other accoutrements of courtly life from the Chosôn Dynasty have been taken up, although transformed, in contemporary rituals among spirit-possessed Shamans. Through a comparison of Hanyang kut - the rituals of the Hanyang Shamans - and the ritual practice of Inner Asian Shamans, and through an analysis of the relations of spirit-possession music rituals to musok, the indigenous religion of Korea, Seo sheds light on the role of music, spiritual practice and culture in present-day Korea.","author":[{"family":"Seo","given":"Maria K."}],"ISBN":"978-1-00-000543-1","issued":{"date-parts":[[2019,8,21]]},"language":"en","number-of-pages":"347","publisher":"Routledge","source":"Google Books","title":"Hanyang Kut: Korean Shaman Ritual Music from Seoul","title-short":"Hanyang Kut","type":"book"},
  {"id":"smithGenerativeDesignTextiles","abstract":"This paper reports on two generative systems that work in the domain of textiles: the Hoopla system that generates patterns for embroidery samplers, and the Foundry system that creates foundation paper piecing patterns for quilts. Generated patterns are enacted and interpreted by the human who stitches the ﬁnal product, following a long and laborious, yet entertaining and leisurely, process of stitching and sewing. The blending of digital and physical spaces, the tension between machine and human authorship, and the juxtaposition of stereotypically masculine computing with highly feminine textile crafts, leads to the opportunity for new kinds of tools, experiences, and artworks. This paper argues for the values of textiles as a domain for generative methods research, and discusses generalizable research problems that are highlighted through operating in this new domain.","author":[{"family":"Smith","given":"Gillian"}],"language":"en","page":"7","source":"Zotero","title":"Generative Design for Textiles: Opportunities and Challenges for Entertainment AI","type":"article-journal"},
  {"id":"spiegelManipulationsMusicalPatterns1981","author":[{"family":"Spiegel","given":"Laurie"}],"container-title":"Proceedings of the Symposium on Small Computers and the Arts","issued":{"date-parts":[[1981]]},"page":"19–22","title":"Manipulations of Musical Patterns","type":"paper-conference"},
  {"id":"splitstoserParentheticalNotationMethod2012","abstract":"Semantic Scholar extracted view of \"The Parenthetical Notation Method for Recording Yarn Structure\" by Jeffrey C Splitstoser","accessed":{"date-parts":[[2021,1,6]]},"author":[{"family":"Splitstoser","given":"Jeffrey C."}],"container-title":"undefined","issued":{"date-parts":[[2012]]},"language":"en","title":"The Parenthetical Notation Method for Recording Yarn Structure","type":"webpage","URL":"https://www.semanticscholar.org/paper/The-Parenthetical-Notation-Method-for-Recording-Splitstoser/6081ffcb5fe9e539df275d2c0d93ec1cf5551c2f"},
  {"id":"steenSciencePatterns1988","abstract":"The rapid growth of computing and applications has helped cross-fertilize the mathematical sciences, yielding an unprecedented abundance of new methods, theories, and models. Examples from statistical science, core mathematics, and applied mathematics illustrate these changes, which have both broadened and enriched the relation between mathematics and science. No longer just the study of number and space, mathematical science has become the science of patterns, with theory built on relations among patterns and on applications derived from the fit between pattern and observation.","accessed":{"date-parts":[[2020,12,4]]},"author":[{"family":"Steen","given":"Lynn Arthur"}],"container-title":"Science","DOI":"10.1126/science.240.4852.611","ISSN":"0036-8075, 1095-9203","issue":"4852","issued":{"date-parts":[[1988,4,29]]},"language":"en","page":"611-616","PMID":"17840903","publisher":"American Association for the Advancement of Science","section":"Articles","source":"science.sciencemag.org","title":"The Science of Patterns","type":"article-journal","URL":"https://science.sciencemag.org/content/240/4852/611","volume":"240"},
  {"id":"thomasPatternsPlaneSymmetry2007","author":[{"family":"Thomas","given":"B. G"},{"family":"Hann","given":"M. A"},{"literal":"University of Leeds"},{"literal":"International Textiles Archive"}],"event-place":"Leeds","ISBN":"978-0-9549640-2-3","issued":{"date-parts":[[2007]]},"language":"en","note":"OCLC: 229408671","publisher":"University of Leeds","publisher-place":"Leeds","source":"Open WorldCat","title":"Patterns in the plane and beyond: symmetry in two and three dimensions","title-short":"Patterns in the plane and beyond","type":"book"},
  {"id":"universityofalaskasoutheastMukhopadhyayEthnomathematicsMathematics2019","abstract":"Friday, November 22\n\nEthnomathematics: Mathematics of People\nSwapna Mukhopadhyay, Ph.D., Professor Emerita, Portland State University\n\nEthnomathematics rejects the common perception of mathematics as independent of culture. Building on advances in anthropological ideologies away from white cultural and intellectual supremacy, ethnomathematics acknowledges that mathematics is pervasive in everyone’s life and community, in terms of construction, trade, craftsmanship, and so on, practices that are historically, socially, and culturally embedded. Such activities rarely if ever involve the solution of quadratic equations, or computations such as 3/7 + 5/9, disembodied exercises that are so prominent in school mathematics, which thereby often alienates students. The needs of society for a cadre of people skilled in academic mathematics and its applications does not justify the collateral damage done by school mathematics in terms of unnecessarily cutting off educational and financial opportunities, and damage to intellectual and cultural identities. It does not have to be like that.","accessed":{"date-parts":[[2021,1,5]]},"dimensions":"1:09:03","director":[{"literal":"University of Alaska Southeast"}],"issued":{"date-parts":[[2019,11,22]]},"source":"YouTube","title":"Mukhopadhyay - Ethnomathematics: Mathematics of People (youtube)","title-short":"Swapna Mukhopadhyay, Ph.D. // Ethnomathematics","type":"motion_picture","URL":"https://www.youtube.com/watch?v=-N3hDMrKBQs"},
  {"id":"washburnSymmetryComesAge2004","abstract":"This is the companion volume to the authors' groundbreaking Symmetries of Culture, the classic reference for symmetry analysis of pattern for anthropologists, archaeologists, art historians, mathematicians, and designers. Central to symmetry analysis is the use of symmetry in the more precise sense of its geometrical isometries in contrast to its everyday meaning of balance. For this volume, Donald Crowe and Dorothy Washburn invited colleagues from several disciplines to apply the method of symmetry analysis to actual case studies from cultures around the world.The essays compiled here explore how cultural information is embedded in the symmetrical structure of pattern. From descriptions of patterns on objects as diverse as Nasca embroideries, Ica Valley ceramics, Quechua textiles, Yombe mats, and Zulu beadwork, as well as from Amazonian shamanic therapy, ceramic design among the Shipibo, and Turkish Yörük weaving, the contributors reveal how the symmetrical structures in the patterns describe aspects of each culture's fundamental principles for living in the world. This approach offers a profoundly fresh way to read the meaning in pattern by arguing that pattern communicates through the structural metaphorsembedded in the symmetrical relationship of the pattern parts. The two volumes together offer readers a revolutionary new window into the communicative importance of design.","author":[{"family":"Washburn","given":"Washburn","suffix":"Dorothy Koster"},{"family":"Washburn","given":"Dorothy Koster"},{"family":"Crowe","given":"Donald W."},{"family":"Crowe","given":"Donald Warren"}],"ISBN":"978-0-295-98366-0","issued":{"date-parts":[[2004]]},"language":"en","number-of-pages":"396","publisher":"University of Washington Press","source":"Google Books","title":"Symmetry Comes of Age: The Role of Pattern in Culture","title-short":"Symmetry Comes of Age","type":"book"},
  {"id":"wolfSpielenUndBedienen2016","abstract":"Author: Wolf, Rebecca; Genre: Book Chapter; Published in Print: 2016; Title: Spielen und bedienen : das selbstspielende Klavier als virtuose Maschine","accessed":{"date-parts":[[2021,1,28]]},"author":[{"family":"Wolf","given":"Rebecca"}],"ISBN":"978-3-8376-3036-7","issued":{"date-parts":[[2016]]},"language":"deu","page":"137-156","publisher":"Transcript Verlag","source":"pure.mpg.de","title":"Spielen und bedienen : das selbstspielende Klavier als virtuose Maschine","title-short":"Spielen und bedienen","type":"book","URL":"https://pure.mpg.de/pubman/faces/ViewItemOverviewPage.jsp?itemId=item_2430330_5"}
]
